{
  "genres": [
    {
      "id": 1,
      "name": "Fiction"
    },
    {
      "id": 2,
      "name": "Mystery"
    },
    {
      "id": 3,
      "name": "Science Fiction"
    },
    {
      "id": 4,
      "name": "Fantasy"
    },
    {
      "id": 5,
      "name": "Romance"
    },
    {
      "id": 6,
      "name": "Thriller"
    },
    {
      "id": 7,
      "name": "Horror"
    },
    {
      "id": 8,
      "name": "Biography"
    },
    {
      "id": 9,
      "name": "Historical Fiction"
    },
    {
      "id": 10,
      "name": "Adventure"
    },
    {
      "id": 11,
      "name": "Non-fiction"
    },
    {
      "id": 12,
      "name": "Young Adult"
    },
    {
      "id": 13,
      "name": "Science"
    },
    {
      "id": 14,
      "name": "Self-Help"
    },
    {
      "id": 15,
      "name": "Satire"
    },
    {
      "id": 16,
      "name": "Poetry"
    },
    {
      "id": 17,
      "name": "History"
    },
    {
      "id": 18,
      "name": "Religion"
    },
    {
      "id": 19,
      "name": "Philosophy"
    },
    {
      "id": 20,
      "name": "Travel"
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "Jonathan Smith",
      "email": "john.smith@example.com",
      "phone": "6165897523"
    },
    {
      "id": 2,
      "name": "Janeth Doe",
      "email": "jane.doe@example.com",
      "phone": "6158963202"
    },
    {
      "id": 3,
      "name": "Michael Johnson",
      "email": "michael.johnson@example.com",
      "phone": "6157894587"
    },
    {
      "id": 4,
      "name": "Emily Davis",
      "email": "emily.davis@example.com",
      "phone": "6169782235"
    },
    {
      "id": 5,
      "name": "David Wilson",
      "email": "david.wilson@example.com",
      "phone": "4042561478"
    },
    {
      "id": 6,
      "name": "Sophia Brown",
      "email": "sophia.brown@example.com",
      "phone": "2028675309"
    },
    {
      "email": "Spencer.serv@gmail.com",
      "name": "Spencer Norris",
      "phone": "6155000210",
      "id": 7
    }
  ],
  "books": [
    {
      "id": 1,
      "title": "The Wanderer",
      "author": "Sharon Creech",
      "genreId": 10,
      "description": "Thirteen-year-old Sophie hears the sea calling, promising adventure and a chance for discovery as she sets sail for England with her three uncles and two cousins. Sophie's cousin Cody isn't so sure he has the strength to prove himself to the crew and to his father.",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/c/c1/Cover_art_of_The_Wanderer_by_Sharon_Creech.jpeg/220px-Cover_art_of_The_Wanderer_by_Sharon_Creech.jpeg"
    },
    {
      "id": 2,
      "title": "Animal Farm",
      "author": "George Orwell",
      "genreId": 15,
      "description": "A farm is taken over by its overworked, mistreated animals. With flaming idealism and stirring slogans, they set out to create a paradise of progress, justice, and equality. Thus the stage is set for one of the most telling satiric fables ever penned—a razor-edged fairy tale for grown-ups that records the evolution from revolution against tyranny to a totalitarianism just as terrible.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Animal_Farm_-_1st_edition.jpg/220px-Animal_Farm_-_1st_edition.jpg"
    },
    {
      "id": 3,
      "title": "Leviathon Wakes",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "Leviathan Wakes is set in a future in which humanity has colonized much of the Solar System. Earth, governed by the United Nations, and the Martian Congressional Republic act as competing superpowers, maintaining an uneasy military alliance in order to exert dual hegemony over the peoples of the Asteroid belt, known as 'Belters'. Belters, whose bodies tend to be thin and elongated owing to their low-gravity environments, carry out the gritty, blue-collar work that provides the system with essential natural resources, but are largely marginalized by the rest of the Solar System polity. This class conflict particularly manifests itself in The Outer Planets Alliance (OPA), a network of loosely-aligned militant groups, which seeks to combat the Belt's exploitation at the hands of the 'Inners', who, in turn, have collectively branded the OPA a terrorist organization.",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/0/08/Leviathan_Wakes.jpg/220px-Leviathan_Wakes.jpg"
    },
    {
      "id": 4,
      "title": "Caliban's War",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "Eighteen months after the events of Leviathan Wakes, the polities of the solar system remain in precarious balance as they watch unknowable events unfold on Venus. Earth and Mars are still poised for battle, however, not recognizing the dire warning that the Eros Incident held for humanity.",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/1/15/Calibans_War.jpg/220px-Calibans_War.jpg"
    },
    {
      "id": 5,
      "title": "Abaddon's Gate",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "For generations, the solar system—Mars, the Moon, the Asteroid Belt—was humanity's great frontier. Until now. The alien artifact working through its program under the clouds of Venus has appeared in Uranus's orbit, where it has built a massive gate that leads to a starless dark.",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/6/6b/James_S.A._Corey_-_Abaddon%27s_Gate.jpeg/220px-James_S.A._Corey_-_Abaddon%27s_Gate.jpeg"
    },
    {
      "id": 6,
      "title": "Cibola Burn",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "Cibola Burn sees the crew of the Rocinante on a new frontier, as the rush to colonize the new planets threatens to outrun law and order and give way to war and chaos.",
      "image": "https://upload.wikimedia.org/wikipedia/en/b/be/Cibola_Burn.jpg"
    },
    {
      "title": "Eragon",
      "author": "Christopher Paolini",
      "genreId": 4,
      "description": "The book tells the story of a farm boy named Eragon, who finds a mysterious stone in the mountains. The stone is revealed to be a dragon egg, and a dragon he later names Saphira hatches from it. When the evil King Galbatorix finds out about the egg, he sends monstrous servants to acquire it, making Eragon and Saphira flee from their hometown with a storyteller named Brom. Brom, an old member of an extinct group called the Dragon Riders, teaches Eragon about 'The Ways of the Rider.'",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/c/ce/Eragon_book_cover.png/200px-Eragon_book_cover.png",
      "id": 7
    },
    {
      "title": "Nemesis Games",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "The Rocinante is down for long-term maintenance after the events of Cibola Burn. Three crew members decide to take care of some personal business during the down time. Amos Burton heads to Earth when he learns someone important from his past there has died, both to pay his formal respects, and to make sure no foul play was involved. Alex Kamal heads to Mars in the hopes of getting closure with his ex-wife and to see Bobbie while there. Naomi Nagata heads to Ceres station, when she receives a message that her son Filip is in trouble. While Jim Holden supervises repairs to the Rocinante, he is enlisted by Monica Stuart to investigate disappearing colony ships.",
      "image": "https://upload.wikimedia.org/wikipedia/en/6/60/Nemesis_Games.jpg",
      "id": 8
    },
    {
      "title": "Babylon's Ashes",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "In Bablyon's Ashes, the so-called Free Navy, made up of Belters using stolen military ships, has been growing ever bolder. After the crippling attacks on Earth and the Martian Navy, the Free Navy turns its attention to the colony ships headed for the ring gates and the worlds beyond. The relatively defenseless ships are left to fend for themselves, as neither Earth nor Mars is powerful enough to protect them. James Holden and the crew of the Rocinante are called upon once again by what remains of the UN and Martian governments to go to Medina Station, now in the hands of the Free Navy, in the ring station. On the other side of the rings, an alien threat is growing: the Free Navy may be the least of humanity's problems.",
      "image": "https://upload.wikimedia.org/wikipedia/en/6/68/Babylons_Ashes.jpg",
      "id": 9
    },
    {
      "title": "Persepolis Rising",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "Twenty-eight years have passed since the events of Babylon's Ashes and Earth is back on its feet after the attack that crippled the planet in Nemesis Games. The crew of the aging gunship Rocinante are still together, working contracts for the Transport Union, who have control of the Ring station and the 1,300 worlds the gates lead to. After receiving a morally dubious order from Camina Drummer, who now leads the Transport Union, Holden and Naomi decide to retire and hand over the Rocinante's captaincy to Bobbie. No one has heard from Admiral Duarte and his rogue fleet in the thirty years since they broke away from the Martian Congressional Republic Navy, until now. They have spent their time in the Laconia system building an advanced fleet using leftover technology from the protomolecule creators. The Laconians send out a message announcing the end of their self-imposed exile before sending an enormous new battleship called 'Heart of the Tempest' through their gate to capture Medina station and install a new governor. The battleship destroys the railgun emplacements installed by the Free Navy on the ring-gate station using a new magnetic weapon that can disintegrate matter at the atomic level.",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f5/Persepolis_Rising.jpg/220px-Persepolis_Rising.jpg",
      "id": 10
    },
    {
      "title": "Tiamat's Wrath",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "Following the events of Persepolis Rising, James Holden is a captive on Laconia, allowed to roam the grounds of High Consul Winston Duarte’s palace but with little other freedom. He pays his respects to Chrisjen Avasarala, who died four months previously, and talks with her granddaughter and Camina Drummer, former president of the defunct Transport Union.\n\nThrough another of the Ring gates, Elvi Okoye, her husband Fayez and several other scientists are sent on a Laconian mission to the “dead worlds”, systems past the ring gates which have no habitable worlds. They find a planet-size green diamond which interacts strangely with their sample of active protomolecule but are forced by the commander to move on to the next system before they can adequately probe it. They arrive to find a neutron star pushed to the edge of the Tolman-Oppenheimer-Volkov limit, with no other matter in the area. The Laconian commander reveals their plan to send an antimatter-laden ship through the ring gates to attack the creatures which have been seen “eating” ships.",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/6/67/Tiamats_Wrath.jpg/220px-Tiamats_Wrath.jpg",
      "id": 11
    },
    {
      "title": "Leviathan Falls",
      "author": "James S. A. Corey",
      "genreId": 3,
      "description": "Following the events of Tiamat's Wrath, Winston Duarte, seemingly awakening from his semi-catatonic state, projects himself into Trejo's mind, who is currently reconquering the Sol system for the Laconian Empire. Duarte expresses gratitude for Trejo's efforts in preserving the Empire and admits they had been thinking too small in their empire-building vision. Duarte then vanishes, prompting Trejo to order a return to Laconia. Upon arrival, Duarte has already disappeared from the state building, and Colonel Aliana Tanaka is tasked to locate him with the highest level of clearance.\n\nTanaka's search leads her to the cave Amos Burton once inhabited, where she deduces that Duarte likely left in an alien ship. She decides to use Teresa as bait to lure Duarte and begins investigating a girls' boarding school on a colony world as a possible location for Teresa. Meanwhile, Elvi and her team, along with the immortal children Xan and Cara, are investigating the Adro Diamond. As they dive into the library using the catalyst, some of Cara's experiences bleed into Amos, who has been similarly altered.",
      "image": "https://upload.wikimedia.org/wikipedia/en/7/7c/Leviathan_Falls.jpg",
      "id": 12
    }
  ],
  "reviews": [
    {
      "id": 1,
      "bookId": 5,
      "userId": 1,
      "text": "This book was awesome from start to finish. Very good detail!"
    },
    {
      "id": 3,
      "bookId": 5,
      "userId": 2,
      "text": "It WORKS"
    },
    {
      "bookId": 1,
      "userId": 1,
      "text": "I love the story, the characters and the setting. Very well planned out!",
      "id": 5
    },
    {
      "bookId": 7,
      "userId": 1,
      "text": "Love the Blue Dragon! Great Story!",
      "id": 6
    },
    {
      "bookId": 3,
      "userId": 1,
      "text": "James is my favorite author of all time! Great story design!",
      "id": 7
    },
    {
      "bookId": 2,
      "userId": 2,
      "text": "Great book! Excellent Delivery!",
      "id": 8
    },
    {
      "bookId": 1,
      "userId": 2,
      "text": "Great book! Excellent Delivery!",
      "id": 9
    }
  ]
}